/*
Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
Входные данные
Первая строка входного файла INPUT.TXT содержит натуральное число N – количество элементов в массиве. 
Во второй строке записаны N целых чисел Ai, разделенные пробелом. Третья строка содержит число X. 
Все числа во входных данных не превосходят 1000 по абсолютной величине.
Выходные данные
В выходной файл OUTPUT.TXT выведите значение элемента массива, ближайшее к X. 
Если таких значений несколько, следует вывести наименьшее среди них.
*/

