/*
Задан целочисленный массив, состоящий из N элементов. 
Требуется посчитать число инверсий (обмена значений соседних элементов массива) 
в процессе сортировки элементов массива по неубыванию при использовании алгоритма сортировки «пузырьком» (BubbleSort).
Входные данные
Первая строка входного файла INPUT.TXT содержит натуральное число N – количество элементов в массиве (N ≤ 1000). 
Во второй строке содержатся N целых чисел, не превосходящих 109 по абсолютной величине.
Выходные данные
В выходной файл OUTPUT.TXT выведите целое число – количество инверсий в процессе сортировки методом «пузырька».
*/
